art_share/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 1], ["created_at", "2021-09-16 19:03:32.095171"], ["updated_at", "2021-09-16 19:03:32.095171"]]
---
  def create
    @artwork_share = ArtworkShare.new(artwork_share_params)
    if @artwork_share.save