art_share/app/controllers/artworks_controller.rb

  def index
    # debugger
    if params[:user_id]
    # @artworks = Artwork.all

      @artworks = Artwork.left_outer_joins(:shares).where("artworks.artist_id = #{params[:user_id]} OR artwork_shares.viewer_id = #{params[:user_id]}")
    else
      @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = 1 OR artwork_shares.viewer_id = 1)
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artwork_shares.viewer_id = 1 AND artworks.artist_id = 1)