art_share/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE (comments.commenter_id = 1)
---
    def index
        if params[:user_id]
            @comments = Comment.where("comments.commenter_id = #{params[:user_id]}")
        elsif params[:artwork_id]
            @comments = Comment.where("comments.artwork_id = #{params[:artwork_id]}")
        else
            @comments= Comment.all

INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter_id", 1], ["artwork_id", 2], ["body", "great work Emmay!!!!!"], ["created_at", "2021-09-16 21:04:58.329735"], ["updated_at", "2021-09-16 21:04:58.329735"]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.save