art_share/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "hien123"], ["created_at", "2021-09-16 15:45:36.678081"], ["updated_at", "2021-09-16 15:45:36.678081"]]
---
  def create
    @user = User.new(user_params)
    if @user.save