routes_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Sam"], ["email", "cbn@gmail.com"]]
---
  def create
    user = User.new(user_params)
    # replace the `user_attributes_here` with the actual attribute keys
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Cathy"], ["email", "cathy@123.com"], ["id", 3]]
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)